Autodesk.Revit.DB.BuiltInFailures.ImageFailures.InvalidWidth
The image width must be  must be no more than 30000 feet.

Autodesk.Revit.DB.BuiltInFailures.ImageFailures.InvalidHeight
The image height must be  must be no more than 30000 feet.